app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating in ('G','PG','PG-13','R','NC-17'))
---
  def index
    @movies = Movie.where('rating in (?)', selected_ratings.order(params[:order])
    @all_ratings = all_ratings
  end

  def new
    # default: render 'new' template
  end

  def create
    @movie = Movie.create!(params[:movie])
    flash[:notice] = "#{@movie.title} was successfully created."
    redirect_to movies_path
  end

  def edit
    @movie = Movie.find params[:id]
  end

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])